{
  "content": "\n# Setting up RDM 13 on macOS\n\nThis is a summary of my experience bringing up a vanilla Developer Invenio RDM 13 experience on macOS 15.6 running on a M1 Mac Mini. I use Mac Ports for supporting development.  I use uv to manage Python.\n\nThe instructions I was following are found at <https://inveniordm.docs.cern.ch/install/>. I am doing a \"developer\" setup.\n\nIf you run into problems I highly recommend making sure you have a \"clean\" system before proceeding. This is especially true if you've had more than one version of Python on your machine (regardless of how), installed RDM in the past or have had older versions of Docker Desktop before. RDM is complicated and brittle even run in containers. Having a clean system is essential to a positive RDM experience.\n\n## Make sure you have a clean system\n\n- removed Docker Desktop and all related files\n- removed all Mac Ports pythons\n- removed all pythons via uv\n- removed uv\n- remove ImageMagick and it's dependencies via Mac Ports, make sure your PATH and LD_LIBRARY_PATH are clean\n- make sure any stale environment (e.g. .bashrc, .profile, etc) are removed\n- rebooted system\n- Confirm there is no Docker, non-system Python, ImageMagick\n- Confirm your environment is clean (do you have references to removed things in your PATH or LD_LIBRARY_PATH?)\n\n## Preparing your machine\n\nOnce I had a clean system here's the steps I took.\n\n1. Install of [uv](https://docs.astral.sh/uv/getting-started/installation/)\n2. Install python3.12 as default using uv, `uv python install 3.12 --default`\n3. Install Docker Desktop\n4. Install ImageMagick7 via Mac Ports, `sudo port install ImageMagick7`\n5. Install cairo via Mac Ports, `sudo port install cairo`\n6. Make sure that Mac Ports `libcairo.2.dylib` is symbolically linked to `/usr/local/lib`\n7. Install openssl via Mac Ports, `sudo port install openssl`\n\n## Installing RDM 13\n\nYou should now be prepared to follow the instructions at <https://inveniordm.docs.cern.ch/install/#quick-start>.\n\nWhen you follow the Quick Install pick the `uv` example under **Install the CLI tool** heading.\n\n- Make a directory to hold your install\n- Run the setup sequence from Quick Start\n\nWhat follows are the commands (with comments) that I ran to bring RDM 13 up on my machine after I cleaned it up and prepared\n\n~~~\nmkdir rdm_test                  # this is my test directory\ncd rdm_test\nuv tool install invenio-cli\ninvenio-cli check-requirements  # If this doesn't pass you probably have a dirty system still\ninvenio-cli init rdm            # Accept all the defaults for testing\ncd my-site\ninvenio-cli check-requirements --development  # If this doesn't pass ...\n# Install Python and Javascript packages, you'll see warns about depreciated packages and Node stuff (that's normal)\ninvenio-cli install\n# Set up containerized database, cache, OpenSearch, etc. You'll see warnings about depreciated stuff\ninvenio-cli services setup\n# Serve the application locally through a development server. This will result in a bunch of logged output\n# and continue for a while. Be patient. There will be warning sprinkled in there too.\ninvenio-cli run\n~~~\n\nIn another terminal windows point your browser at <https://127.0.0.1:5000/>, click through the warnings about the self signed cert.\n\n~~~\nopen https://127.0.0.1:5000/\n~~~\n\nYou should now have a running vanilla RDM 13 instance up. To bring it down do that following.\n\n~~~\n# To stop the application server:\n# in terminal running invenio-cli run\n^C [CTRL+C]\n# ---\n# To stop the service containers:\ninvenio-cli services stop\n# ---\n# To destroy the service containers\n# (this will lose ALL data):\ninvenio-cli services destroy\n~~~\n",
  "data": {
    "abstract": "This is a summary of the steps I took to successfully setup RDM 13 on my M1 Mac Mini running macOS 15.6. I use Mac Ports for dependencies.\n",
    "author": "rsdoiel@caltech.edu (R. S. Doiel)",
    "dateCreated": "2025-08-01",
    "dateModified": "2025-08-01",
    "datePublished": "2025-08-01",
    "keywords": [
      "Invenio",
      "RDM"
    ],
    "title": "Setting up RDM 13 on macOS M1 Mac Mini"
  }
}